backend/controllers/SiteController.php

    public function actionIndex()
    {
        $item=array();
       $qualification=TblAppQuali::find()->count();
       $admission=TblAppAdmission::find()->count();
       $application=TblApp::find()->select('id')->count();
       $students=TblStud::find()->select('id')->count();

       $lecturer=TblLecturer::find()->select('id')->count();

       $staff=TblStaff::find()->select('id')->count();

       $userAdmins=User::find()->select('id')->count();
---
SELECT COUNT(*) FROM `user`