frontend/modules/student/views/tbl-course/index.php


    'toolbar' =>  [

        ['content'=>
           Html::dropDownList('level_id','levels', ArrayHelper::map(TblLevel::find()->asArray()->all(),'id','level_name'),['class' => 'form-control mr-5'])
        ],
---
SELECT * FROM `tbl_level`