frontend/modules/lecturer/controllers/LecturerController.php

SELECT * FROM `tbl_staff_list` WHERE `user_id`=1
---
    public function actionIndex()
    {
        if(Yii::$app->user->can('lecturer')){
            // try{
                $id=Yii::$app->user->identity->id;
                $model= TblStaffList::find()->where(['user_id'=>$id])->one();

SELECT * FROM `tbl_staff_list` WHERE `user_id`=1
SELECT * FROM `tbl_course_lecturer` WHERE `lecturer_id`=1
---
    public function actionResult(){
        if(Yii::$app->user->can('lecturer')){
            // try{
        $id=Yii::$app->user->identity->id;
        $model= TblStaffList::find()->where(['user_id'=>$id])->one();
        $lecC= TblCourseLecturer::find()->andwhere(['lecturer_id'=>$model->id])->all();