frontend/controllers/SiteController.php

protected function personalDetails(){
    if(($model=TblAppPersDetails::find()->where(['osn_id'=>$this->osnID()])->one()) !==null){
---
SELECT * FROM `tbl_app_pers_details` WHERE `osn_id`=26

protected function  applicantEmployment(){
    if(($model=TblAppEmpDetails::find()->where(['osn_id'=>$this->osnID()])->one())){
---
SELECT * FROM `tbl_app_emp_details` WHERE `osn_id`=26