frontend/modules/student/views/tbl-st-registration/index.php

SELECT * FROM `tbl_level`
SELECT * FROM `tbl_semester`
---
        'tableOptions' => ['class' => 'table table-striped table-hover table-condensed text-left'],
        'toolbar' =>  [

            ['content'=>
               Html::dropDownList('level_id','levels', ArrayHelper::map(TblLevel::find()->asArray()->all(),'id','level_name'),['class' => 'form-control mr-5'])
            ],

            ['content'=>
              Html::dropDownList('semester','Semester', ArrayHelper::map(TblSemester::find()->asArray()->all(),'id','name'),['class' => 'form-control mr-5'])
            ],