frontend/modules/student/views/tbl-st-registration/result.php

SELECT * FROM `tbl_studs_result` WHERE (`student_id`=1) AND (`acadamic_year`=1)
---
                                <!-- <th>Grade Point</th> -->
                            </tr>
                    </thead>
                    <?php foreach(TblStudsResult::find()->andwhere(['student_id'=>$id])->andWhere(['acadamic_year'=>$acadamicyear->id])->all() as $result): ?>