common/models/TblCountryQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `tbl_country`