common/models/User.php

SELECT * FROM `tbl_user` WHERE `id`=1
---
    public static function findIdentity($id) {
        return self::findOne($id);

SELECT * FROM `tbl_user` WHERE `username`='888888'
---
    public static function findByUsername($username) {
        return static::findOne(['username' => $username]);