backend/views/servicings/_form.php

SELECT * FROM `vehicles`
SELECT * FROM `drivers`
---
        'formConfig' => ['labelSpan' => 2, 'deviceSize' => ActiveForm::SIZE_SMALL]
    ]);  ?>

      <?= $form->field($model, 'vehicle_id')->widget(Select2::className(),[
            'data'=>ArrayHelper::map(Vehicles::find()->asArray()->all(),'id','make'),
            'options'=>['placeholder'=>'Vehicle'],
            'language'=>'en',
            'pluginOptions'=>[
                'allowClear'=>true,
            ]]);  ?>

    <?= $form->field($model, 'driver_id')->widget(Select2::className(),[
                'data'=>ArrayHelper::map(Drivers::find()->asArray()->all(),'id','name'),
                'options'=>['placeholder'=>'Driver'],
                'language'=>'en',
                'pluginOptions'=>[
                    'allowClear'=>true,
                ]]); ?>