frontend/modules/lecturer/views/lecturer/result.php

                </thead>
                <tbody>
                    <?php foreach( $lecC as $course): ?>
                    <?php $total= TblStRegistration::find()->andwhere(['courese_id'=>$course->course->id])
                            ->andWhere(['level_id'=>$course->course->level->id])
                            ->andWhere(['semester'=>$course->course->semester0->id])
---
SELECT COUNT(*) FROM `tbl_st_registration` WHERE (`courese_id`=1) AND (`level_id`=1) AND (`semester`=1)
SELECT * FROM `tbl_course` WHERE `id`=1
SELECT * FROM `tbl_level` WHERE `id`=1
SELECT * FROM `tbl_semester` WHERE `id`=1