frontend/modules/student/controllers/DefaultController.php

SELECT * FROM `tbl_stud` WHERE `user_id`=1
---
    public function actionIndex()
    {
        if(Yii::$app->user->can('student')){

            $personal=TblStud::find()->where(['user_id'=>Yii::$app->user->identity->id])->one();