frontend/modules/student/controllers/TblCourseController.php

SELECT * FROM `tbl_stud` WHERE `user_id`=1
---
    public function actionIndex()
    {
        if(Yii::$app->user->can('student')){
            // try{
    $userId=TblStud::find()->where(['user_id'=>Yii::$app->user->identity->id])->one();

SELECT * FROM `tbl_st_registration` WHERE (`stud_Id`=1) AND (`status`=1)
---
       ->all();


        $select1=TblStRegistration::find()->andWhere(['stud_Id'=>$userId->id])->andWhere(['status'=>1])