frontend/modules/student/controllers/TblStRegistrationController.php

    public function actionIndex()
    {
        if(Yii::$app->user->can('student')){
        try{
        $id=Yii::$app->user->identity->id;

        $studId=TblStud::find()->where(['user_id'=>$id])->one();
---
SELECT * FROM `tbl_stud` WHERE `user_id`=1

    public function actionResult(){
         if(Yii::$app->user->can('student')){
    try{
        $id=Yii::$app->user->identity->id;

        $stud=TblStud::find()->where(['user_id'=>$id])->select('id')->one();

        $result=TblStudsResult::find()->where(['student_id'=>$stud->id])->all();

        $studAcad=TblStudRegistYear::find()->all();
---
SELECT `id` FROM `tbl_stud` WHERE `user_id`=1
SELECT * FROM `tbl_studs_result` WHERE `student_id`=1
SELECT * FROM `tbl_stud_regist_year`