frontend/modules/student/controllers/TblStRegistrationController.php

    public function actionResult(){
         if(Yii::$app->user->can('student')){
    try{
        $id=Yii::$app->user->identity->id;

        $stud=TblStud::find()->where(['user_id'=>$id])->one();
---
SELECT * FROM `tbl_stud` WHERE `user_id`=1